ruby/Q.org
#+TITLE:     Q
#+AUTHOR:    Hao Ruan
#+EMAIL:     haoru@cisco.com
#+LANGUAGE:  en
#+LINK_HOME: http://www.github.com/ruanhao
#+OPTIONS:   h:6 html-postamble:nil html-preamble:t tex:t f:t ^:nil
#+STARTUP:   showall
#+TOC:       headlines 3
#+HTML_DOCTYPE: <!DOCTYPE html>
#+HTML_HEAD: <link href="http://fonts.googleapis.com/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
#+HTML_HEAD: <link href="../org-html-themes/solarized/style.css" rel="stylesheet" type="text/css" />
 #+HTML: <div class="outline-2" id="meta">
| Author   | {{{author}}} ({{{email}}})    |
| Date     | {{{time(%Y-%m-%d %H:%M:%S)}}} |
#+HTML: </div>


* [[https://wordsinasentence.com/quagmire-in-a-sentence/][Quagmire]]

  =a situation from which it is hard to escape=

  - Many young people do not realize the quagmire to which occasional drug use can lead.
  - Since Jim lost all of his money gambling, he is stuck in a financial quagmire.
  - When Hank called me from jail, I knew he was in a quagmire.
  - When Marie’s car broke down, getting to work became a quagmire for her.

* [[https://wordsinasentence.com/quaint-in-a-sentence/][Quaint]]

  =appearing old-fashioned in an appealing way=

  - My grandmother’s quaint home is filled with knick-knacks from her childhood.
  - As I walked through the quaint shop, I felt as though I was transported back in time.
  - The quaint village does not appear to have changed since it was first settled in the early 1900s.
  - Before I left the old house, I had to sit in the quaint rocking chairs on the front porch.
  - The antebellum mansion looks very quaint under the moss-covered trees.
  - As soon as we entered the quaint home, we noticed it was filled with charming antiques.
  - Tabitha looked adorable in her quaint homemade dress.


* [[https://wordsinasentence.com/qualm-in-a-sentence/][Qualm]]

  =a feeling of doubt or uncertainty about whether you are doing the right thing=

  - Under the influence of drugs, Matt had no qualm whatsoever about spending all of his money at the casino.
  - I have a serious qualm about my teenage daughter dating an older man.
  - Without any qualm, the killer shot the young woman in the face.
  - My qualm with this company is their lack of contributions to local charities.
  - The crooked businessman appeared to have no qualm about tearing down the nursing home to build a parking lot.
  - As Jenna walked down the aisle to meet her future husband, she experienced a qualm that almost made her change her mind about getting married.
  - When Margaret desperately needed money, she seemed to have no qualm about robbing others.


* [[https://wordsinasentence.com/quantifiable-in-a-sentence/][Quantifiable]]

  =able to be measured=

  - Scientists used a calculator to average the quantifiable data gathered during the experiment.
  - Although the teacher tried to determine which children were the best readers from the assessment, the results were not quantifiable.
  - After grading all of the quantifiable tests, the teacher wrote letter grades on each one.
  - Quantifiable surveys were conducted to gauge the number of employees who were unhappy with current insurance options.


* [[https://wordsinasentence.com/quantum-in-a-sentence/][Quantum]]

  =The smallest amount of something, specifically energy=

  - Measuring the quantum amount of the object essentially destroyed it.
  - Quantum complexities are just a small part of the make-up of the human brain.
  - Quantum mechanics was used to explain properties of several energy forms.
  - While quantum energy could not be measured fully, the scientist continued to work on the experiment.




* [[https://wordsinasentence.com/quash-in-a-sentence/][Quash]]

  =to put an end to something=

  - Refusing to give in to the toddler’s demands, the exasperated mother was hell-bent on coming up with a plan to quash the tantrums.
  - My defense team tried to quash the subpoena but it was served anyway.
  - Tired of squabbling, the exhausted husband agreed to quash the argument and go shopping with his wife.
  - Scientists were able to quickly quash the outbreak through a new immunization.


* [[https://wordsinasentence.com/querulous-in-a-sentence/][Querulous]]

  =full of complaints; complaining=

  - If there was an award for being querulous, my aunt would win because she is always complaining about something.
  - I don’t mean to be querulous, but I do believe I should get my money’s worth at all times.
  - Forgive me for sounding querulous, but there is a bug in my soup.
  - Whenever my father had too many drinks, he would become querulous and complain about everything.
  - During the plane trip, I had to sit next to a querulous lady who did nothing but criticize the flight attendants.
  - If my little boy does not take his nap on time, he becomes querulous and finds fault with everything.
  - I was a querulous kid who always argued with my mother when she put vegetables on my dinner plate.


* [[https://wordsinasentence.com/quiescent-in-a-sentence/][Quiescent]]

  =not active; quiet=

  - For once, our hyperactive Great Dane is quiescent and resting on the rug.
  - Now that school has started back, my neighborhood is pretty quiescent during the day.
  - While the bees are quiescent early in the morning and in the evening, they are overactive in the middle of the day.
  - During the quiescent phase of the lab, we simply observe and note the growth of the cells.
  - After the mediation between the two warring countries, the region became quiescent.
  - You have no reason to be concerned about the quiescent volcano.
  - As long as the protest remains quiescent, the police will not be called.


