ruby/Q.html
<!DOCTYPE html>
<html>
<head>
<title>Q</title>
<!-- 2018-05-08 Tue 23:08 -->
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<meta  name="author" content="Hao Ruan">
<link href="http://fonts.googleapis.com/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
<link href="../org-html-themes/solarized/style.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">Q</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Quagmire</a></li>
<li><a href="#sec-2">2. Quaint</a></li>
<li><a href="#sec-3">3. Qualm</a></li>
<li><a href="#sec-4">4. Quantifiable</a></li>
<li><a href="#sec-5">5. Quantum</a></li>
<li><a href="#sec-6">6. Quash</a></li>
<li><a href="#sec-7">7. Querulous</a></li>
<li><a href="#sec-8">8. Quiescent</a></li>
<li><a href="#sec-9">9. Quixotic</a></li>
<li><a href="#sec-10">10. Quaff</a></li>
<li><a href="#sec-11">11. Quail</a></li>
<li><a href="#sec-12">12. Quandary</a></li>
<li><a href="#sec-13">13. Queer</a></li>
<li><a href="#sec-14">14. Quell</a></li>
<li><a href="#sec-15">15. Quench</a></li>
<li><a href="#sec-16">16. Quibble</a></li>
<li><a href="#sec-17">17. Quirk</a></li>
<li><a href="#sec-18">18. Quondam</a></li>
<li><a href="#sec-19">19. Quotidian</a></li>
</ul>
</div>
</div>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Quagmire</a></li>
<li><a href="#sec-2">2. Quaint</a></li>
<li><a href="#sec-3">3. Qualm</a></li>
<li><a href="#sec-4">4. Quantifiable</a></li>
<li><a href="#sec-5">5. Quantum</a></li>
<li><a href="#sec-6">6. Quash</a></li>
<li><a href="#sec-7">7. Querulous</a></li>
<li><a href="#sec-8">8. Quiescent</a></li>
<li><a href="#sec-9">9. Quixotic</a></li>
<li><a href="#sec-10">10. Quaff</a></li>
<li><a href="#sec-11">11. Quail</a></li>
<li><a href="#sec-12">12. Quandary</a></li>
<li><a href="#sec-13">13. Queer</a></li>
<li><a href="#sec-14">14. Quell</a></li>
<li><a href="#sec-15">15. Quench</a></li>
<li><a href="#sec-16">16. Quibble</a></li>
<li><a href="#sec-17">17. Quirk</a></li>
<li><a href="#sec-18">18. Quondam</a></li>
<li><a href="#sec-19">19. Quotidian</a></li>
</ul>
</div>
</div>
<div class="outline-2" id="meta">
<table>


<colgroup>
<col  class="left">

<col  class="left">
</colgroup>
<tbody>
<tr>
<td class="left">Author</td>
<td class="left">Hao Ruan (haoru@cisco.com)</td>
</tr>

<tr>
<td class="left">Date</td>
<td class="left">2018-05-08 23:08:36</td>
</tr>
</tbody>
</table>
</div>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> <a href="https://wordsinasentence.com/quagmire-in-a-sentence/">Quagmire</a></h2>
<div class="outline-text-2" id="text-1">
<p>
<code>a situation from which it is hard to escape</code>
</p>

<ul class="org-ul">
<li>Many young people do not realize the quagmire to which occasional drug use can lead.
</li>
<li>Since Jim lost all of his money gambling, he is stuck in a financial quagmire.
</li>
<li>When Hank called me from jail, I knew he was in a quagmire.
</li>
<li>When Marie’s car broke down, getting to work became a quagmire for her.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> <a href="https://wordsinasentence.com/quaint-in-a-sentence/">Quaint</a></h2>
<div class="outline-text-2" id="text-2">
<p>
<code>appearing old-fashioned in an appealing way</code>
</p>

<ul class="org-ul">
<li>My grandmother’s quaint home is filled with knick-knacks from her childhood.
</li>
<li>As I walked through the quaint shop, I felt as though I was transported back in time.
</li>
<li>The quaint village does not appear to have changed since it was first settled in the early 1900s.
</li>
<li>Before I left the old house, I had to sit in the quaint rocking chairs on the front porch.
</li>
<li>The antebellum mansion looks very quaint under the moss-covered trees.
</li>
<li>As soon as we entered the quaint home, we noticed it was filled with charming antiques.
</li>
<li>Tabitha looked adorable in her quaint homemade dress.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> <a href="https://wordsinasentence.com/qualm-in-a-sentence/">Qualm</a></h2>
<div class="outline-text-2" id="text-3">
<p>
<code>a feeling of doubt or uncertainty about whether you are doing the right thing</code>
</p>

<ul class="org-ul">
<li>Under the influence of drugs, Matt had no qualm whatsoever about spending all of his money at the casino.
</li>
<li>I have a serious qualm about my teenage daughter dating an older man.
</li>
<li>Without any qualm, the killer shot the young woman in the face.
</li>
<li>My qualm with this company is their lack of contributions to local charities.
</li>
<li>The crooked businessman appeared to have no qualm about tearing down the nursing home to build a parking lot.
</li>
<li>As Jenna walked down the aisle to meet her future husband, she experienced a qualm that almost made her change her mind about getting married.
</li>
<li>When Margaret desperately needed money, she seemed to have no qualm about robbing others.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> <a href="https://wordsinasentence.com/quantifiable-in-a-sentence/">Quantifiable</a></h2>
<div class="outline-text-2" id="text-4">
<p>
<code>able to be measured</code>
</p>

<ul class="org-ul">
<li>Scientists used a calculator to average the quantifiable data gathered during the experiment.
</li>
<li>Although the teacher tried to determine which children were the best readers from the assessment, the results were not quantifiable.
</li>
<li>After grading all of the quantifiable tests, the teacher wrote letter grades on each one.
</li>
<li>Quantifiable surveys were conducted to gauge the number of employees who were unhappy with current insurance options.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> <a href="https://wordsinasentence.com/quantum-in-a-sentence/">Quantum</a></h2>
<div class="outline-text-2" id="text-5">
<p>
<code>The smallest amount of something, specifically energy</code>
</p>

<ul class="org-ul">
<li>Measuring the quantum amount of the object essentially destroyed it.
</li>
<li>Quantum complexities are just a small part of the make-up of the human brain.
</li>
<li>Quantum mechanics was used to explain properties of several energy forms.
</li>
<li>While quantum energy could not be measured fully, the scientist continued to work on the experiment.
</li>
</ul>
</div>
</div>




<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> <a href="https://wordsinasentence.com/quash-in-a-sentence/">Quash</a></h2>
<div class="outline-text-2" id="text-6">
<p>
<code>to put an end to something</code>
</p>

<ul class="org-ul">
<li>Refusing to give in to the toddler’s demands, the exasperated mother was hell-bent on coming up with a plan to quash the tantrums.
</li>
<li>My defense team tried to quash the subpoena but it was served anyway.
</li>
<li>Tired of squabbling, the exhausted husband agreed to quash the argument and go shopping with his wife.
</li>
<li>Scientists were able to quickly quash the outbreak through a new immunization.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> <a href="https://wordsinasentence.com/querulous-in-a-sentence/">Querulous</a></h2>
<div class="outline-text-2" id="text-7">
<p>
<code>full of complaints; complaining</code>
</p>

<ul class="org-ul">
<li>If there was an award for being querulous, my aunt would win because she is always complaining about something.
</li>
<li>I don’t mean to be querulous, but I do believe I should get my money’s worth at all times.
</li>
<li>Forgive me for sounding querulous, but there is a bug in my soup.
</li>
<li>Whenever my father had too many drinks, he would become querulous and complain about everything.
</li>
<li>During the plane trip, I had to sit next to a querulous lady who did nothing but criticize the flight attendants.
</li>
<li>If my little boy does not take his nap on time, he becomes querulous and finds fault with everything.
</li>
<li>I was a querulous kid who always argued with my mother when she put vegetables on my dinner plate.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> <a href="https://wordsinasentence.com/quiescent-in-a-sentence/">Quiescent</a></h2>
<div class="outline-text-2" id="text-8">
<p>
<code>not active; quiet</code>
</p>

<ul class="org-ul">
<li>For once, our hyperactive Great Dane is quiescent and resting on the rug.
</li>
<li>Now that school has started back, my neighborhood is pretty quiescent during the day.
</li>
<li>While the bees are quiescent early in the morning and in the evening, they are overactive in the middle of the day.
</li>
<li>During the quiescent phase of the lab, we simply observe and note the growth of the cells.
</li>
<li>After the mediation between the two warring countries, the region became quiescent.
</li>
<li>You have no reason to be concerned about the quiescent volcano.
</li>
<li>As long as the protest remains quiescent, the police will not be called.
</li>
</ul>
</div>
</div>
