ruby/Q.org
* [[https://wordsinasentence.com/quixotic-in-a-sentence/][Quixotic]]

  =unrealistic and impractical=

  - Although Jack’s plan for killing the giant was quixotic, it was the village’s only hope.
  - Henry knew running for class president was a quixotic idea, but he was not going to let his enemy run unopposed.
  - It is quixotic to think you can get away with walking into the prison and breaking out your boyfriend.
  - While the knight’s quest sounded noble, in reality it was a quixotic plot which could only end in the young man’s death.
  - Everyone told Jennifer her dream of being a Hollywood star was quixotic, but she proved them wrong when she became a ten million dollar actress.
  - Because reality does not always have a happy ending, most women prefer to watch quixotic romantic-comedies that normally end with the girl getting her guy.
  - Nobody believed the tiny boy would achieve his quixotic goal of making the football team.


* [[https://wordsinasentence.com/quaff-in-a-sentence/][Quaff]]

  =to hastily consume a beverage=

  - The huge athlete was able to quaff down a gallon of water in less than two minutes.
  - On any college campus, you can find at least one frat boy who will quaff any beverage given to him.
  - My husband always has to quaff a pot of coffee before leaving for work.
  - When the thirsty sailors were on leave, they would quaff as much beer as they could hold.
  - The intoxicated girl tried to quaff the entire keg.
  - When the man was rescued from the desert, he wanted to quaff the entire bottle of water.
  - After the last final exam, my friends and I went to the pub to quaff a few drinks.


* [[https://wordsinasentence.com/quail-in-a-sentence/][Quail]]

  =a small, short-tailed, commonly hunted bird=

  - Known as a gourmet chef, Emeril Lagasse created a masterpiece of flavors by snipping off the wings and removing the feathers off the quail before roasting and serving it to the queen.
  - For the experienced hunters, hunting quail proved difficult due to its high flying abilities and its brown feathers allowing it to camouflage into nature.
  - When I visited the local park, a quail darted near the pond and pecked with its beak at the bread crumbs lying around.
  - The only artwork I was interested in at the art sale was a watercolor picture of a brown quail perched with its short tail dangling over the tree limb.

* [[https://wordsinasentence.com/quandary-in-a-sentence/][Quandary]]

  =a state of doubt about what to do in a certain situation; a difficult situation=

  - Mark is in a quandary about whether or not he should keep the money he found in the park.
  - When the lawyer told us our lawsuit options, we realized we were in a quandary about which legal path to take.
  - I find myself in a moral quandary about whether or not I should tell my wife the truth about my affair.
  - Because you are in a quandary and doubting your ability to make a decision, I suggest you talk to one of your friends about your problem.
  - Since I am always honest with my parents, I found myself in a quandary when my best friend asked me to lie to my father about my whereabouts.
  - The decline of the housing market has put many real estate agents into a financial quandary.
  - When my husband and I were debating our vacation plans, we were in a quandary between going on a cruise and flying to New York City.

* [[https://wordsinasentence.com/queer-in-a-sentence/][Queer]]

  =strange; odd=

  - Peering into the queer little house, Georgia couldn’t understand why all the unusually shaped furniture was painted pink and blue.
  - Because of his queer habits, the recluse was seen as strange by his fellow townspeople.
  - Lily found it queer that her sister had pet monkey’s but accepted her odd obsession all the same.
  - The queer little object looked like something out of a science fiction movie.


* [[https://wordsinasentence.com/quell-in-a-sentence/][Quell]]

  =to calm or reduce=

  - Before Sarah gives a speech, she always drinks a shot of whiskey to quell her nerves.
  - The old man drinks warm milk to quell his upset stomach.
  - During the riots, over five hundred policemen worked to quell the uproar.
  - The principal tapped the microphone to quell the noise in the auditorium.
  - In order to quell unemployment, the government is giving more business loans.
  - Troops are being deployed to quell the threat of violence from the terrorist nation.
  - Because Hiriam wants to quell his urge to smoke, he is now using nicotine patches.


* [[https://wordsinasentence.com/quench-in-a-sentence/][Quench]]

  =to satisfy an actual or figurative thirst, or to put out a fire=

  - Aiming to quench her thirst, the runner guzzled down the water at full speed.
  - When they were finally able to quench the flames of the fire, the firefighters breathed a sigh of relief.
  - Although it failed to quench her thirst for a summer road trip, the mini-vacation at the lake was a distraction for the avid traveler.
  - Unable to quench the flame on by blowing, the birthday girl laughed as she realized that her parents had bought a prank candle.


* [[https://wordsinasentence.com/quibble-in-a-sentence/][Quibble]]

  =to quarrel about minor matters=

  - It is normal for married couples to quibble over small things like who controls the television remote.
  - Whenever the two historians meet, they quibble over historical facts before drinking a pitcher of beer.
  - We should not quibble over a small detail like borrowed money before your surgery.
  - When my ex-husband and I are together, all we do is quibble over the lack of support he gives me.
  - The billionaire did not quibble over the five-dollar service charge.
  - As usual the city council members chose to quibble over holiday party details rather than deal with the city’s issues.
  - How long do you think the politicians will quibble over the budget proposals before they finally select one?


* [[https://wordsinasentence.com/quirk-in-a-sentence/][Quirk]]

  =an odd behavior or different way of acting=

  - Janice has this irritating quirk of rolling her eyes whenever she speaks.
  - According to Ken, his habit of constantly wringing his hands is just an uncontrollable quirk.
  - Wearing only pink socks is Greg’s oddest quirk.
  - In the film, the killer’s quirk of styling his victims’ hair led the police to the salon where he worked.


