ruby/Q.html


<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> <a href="https://wordsinasentence.com/quixotic-in-a-sentence/">Quixotic</a></h2>
<div class="outline-text-2" id="text-9">
<p>
<code>unrealistic and impractical</code>
</p>

<ul class="org-ul">
<li>Although Jack’s plan for killing the giant was quixotic, it was the village’s only hope.
</li>
<li>Henry knew running for class president was a quixotic idea, but he was not going to let his enemy run unopposed.
</li>
<li>It is quixotic to think you can get away with walking into the prison and breaking out your boyfriend.
</li>
<li>While the knight’s quest sounded noble, in reality it was a quixotic plot which could only end in the young man’s death.
</li>
<li>Everyone told Jennifer her dream of being a Hollywood star was quixotic, but she proved them wrong when she became a ten million dollar actress.
</li>
<li>Because reality does not always have a happy ending, most women prefer to watch quixotic romantic-comedies that normally end with the girl getting her guy.
</li>
<li>Nobody believed the tiny boy would achieve his quixotic goal of making the football team.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> <a href="https://wordsinasentence.com/quaff-in-a-sentence/">Quaff</a></h2>
<div class="outline-text-2" id="text-10">
<p>
<code>to hastily consume a beverage</code>
</p>

<ul class="org-ul">
<li>The huge athlete was able to quaff down a gallon of water in less than two minutes.
</li>
<li>On any college campus, you can find at least one frat boy who will quaff any beverage given to him.
</li>
<li>My husband always has to quaff a pot of coffee before leaving for work.
</li>
<li>When the thirsty sailors were on leave, they would quaff as much beer as they could hold.
</li>
<li>The intoxicated girl tried to quaff the entire keg.
</li>
<li>When the man was rescued from the desert, he wanted to quaff the entire bottle of water.
</li>
<li>After the last final exam, my friends and I went to the pub to quaff a few drinks.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> <a href="https://wordsinasentence.com/quail-in-a-sentence/">Quail</a></h2>
<div class="outline-text-2" id="text-11">
<p>
<code>a small, short-tailed, commonly hunted bird</code>
</p>

<ul class="org-ul">
<li>Known as a gourmet chef, Emeril Lagasse created a masterpiece of flavors by snipping off the wings and removing the feathers off the quail before roasting and serving it to the queen.
</li>
<li>For the experienced hunters, hunting quail proved difficult due to its high flying abilities and its brown feathers allowing it to camouflage into nature.
</li>
<li>When I visited the local park, a quail darted near the pond and pecked with its beak at the bread crumbs lying around.
</li>
<li>The only artwork I was interested in at the art sale was a watercolor picture of a brown quail perched with its short tail dangling over the tree limb.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> <a href="https://wordsinasentence.com/quandary-in-a-sentence/">Quandary</a></h2>
<div class="outline-text-2" id="text-12">
<p>
<code>a state of doubt about what to do in a certain situation; a difficult situation</code>
</p>

<ul class="org-ul">
<li>Mark is in a quandary about whether or not he should keep the money he found in the park.
</li>
<li>When the lawyer told us our lawsuit options, we realized we were in a quandary about which legal path to take.
</li>
<li>I find myself in a moral quandary about whether or not I should tell my wife the truth about my affair.
</li>
<li>Because you are in a quandary and doubting your ability to make a decision, I suggest you talk to one of your friends about your problem.
</li>
<li>Since I am always honest with my parents, I found myself in a quandary when my best friend asked me to lie to my father about my whereabouts.
</li>
<li>The decline of the housing market has put many real estate agents into a financial quandary.
</li>
<li>When my husband and I were debating our vacation plans, we were in a quandary between going on a cruise and flying to New York City.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13"><span class="section-number-2">13</span> <a href="https://wordsinasentence.com/queer-in-a-sentence/">Queer</a></h2>
<div class="outline-text-2" id="text-13">
<p>
<code>strange; odd</code>
</p>

<ul class="org-ul">
<li>Peering into the queer little house, Georgia couldn’t understand why all the unusually shaped furniture was painted pink and blue.
</li>
<li>Because of his queer habits, the recluse was seen as strange by his fellow townspeople.
</li>
<li>Lily found it queer that her sister had pet monkey’s but accepted her odd obsession all the same.
</li>
<li>The queer little object looked like something out of a science fiction movie.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-14" class="outline-2">
<h2 id="sec-14"><span class="section-number-2">14</span> <a href="https://wordsinasentence.com/quell-in-a-sentence/">Quell</a></h2>
<div class="outline-text-2" id="text-14">
<p>
<code>to calm or reduce</code>
</p>

<ul class="org-ul">
<li>Before Sarah gives a speech, she always drinks a shot of whiskey to quell her nerves.
</li>
<li>The old man drinks warm milk to quell his upset stomach.
</li>
<li>During the riots, over five hundred policemen worked to quell the uproar.
</li>
<li>The principal tapped the microphone to quell the noise in the auditorium.
</li>
<li>In order to quell unemployment, the government is giving more business loans.
</li>
<li>Troops are being deployed to quell the threat of violence from the terrorist nation.
</li>
<li>Because Hiriam wants to quell his urge to smoke, he is now using nicotine patches.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-15" class="outline-2">
<h2 id="sec-15"><span class="section-number-2">15</span> <a href="https://wordsinasentence.com/quench-in-a-sentence/">Quench</a></h2>
<div class="outline-text-2" id="text-15">
<p>
<code>to satisfy an actual or figurative thirst, or to put out a fire</code>
</p>

<ul class="org-ul">
<li>Aiming to quench her thirst, the runner guzzled down the water at full speed.
</li>
<li>When they were finally able to quench the flames of the fire, the firefighters breathed a sigh of relief.
</li>
<li>Although it failed to quench her thirst for a summer road trip, the mini-vacation at the lake was a distraction for the avid traveler.
</li>
<li>Unable to quench the flame on by blowing, the birthday girl laughed as she realized that her parents had bought a prank candle.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-16" class="outline-2">
<h2 id="sec-16"><span class="section-number-2">16</span> <a href="https://wordsinasentence.com/quibble-in-a-sentence/">Quibble</a></h2>
<div class="outline-text-2" id="text-16">
<p>
<code>to quarrel about minor matters</code>
</p>

<ul class="org-ul">
<li>It is normal for married couples to quibble over small things like who controls the television remote.
</li>
<li>Whenever the two historians meet, they quibble over historical facts before drinking a pitcher of beer.
</li>
<li>We should not quibble over a small detail like borrowed money before your surgery.
</li>
<li>When my ex-husband and I are together, all we do is quibble over the lack of support he gives me.
</li>
<li>The billionaire did not quibble over the five-dollar service charge.
</li>
<li>As usual the city council members chose to quibble over holiday party details rather than deal with the city’s issues.
</li>
<li>How long do you think the politicians will quibble over the budget proposals before they finally select one?
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-17" class="outline-2">
<h2 id="sec-17"><span class="section-number-2">17</span> <a href="https://wordsinasentence.com/quirk-in-a-sentence/">Quirk</a></h2>
<div class="outline-text-2" id="text-17">
<p>
<code>an odd behavior or different way of acting</code>
</p>

<ul class="org-ul">
<li>Janice has this irritating quirk of rolling her eyes whenever she speaks.
</li>
<li>According to Ken, his habit of constantly wringing his hands is just an uncontrollable quirk.
</li>
<li>Wearing only pink socks is Greg’s oddest quirk.
</li>
<li>In the film, the killer’s quirk of styling his victims’ hair led the police to the salon where he worked.
</li>
</ul>
</div>
</div>
