ruby/Q.org
* [[https://wordsinasentence.com/quondam-in-a-sentence/][Quondam]]

  =former; previous=

  - The quondam beauty queen was much more exotic than the one currently being crowned.
  - Before retiring, the quondam editor trained me to take over his position.
  - Readers were surprised that the quondam CEO was speaking out against the company that he helped build from the ground up.
  - The quondam lovers could barely look at each other after they ended their relationship.



* [[https://wordsinasentence.com/quotidian-in-a-sentence/][Quotidian]]

  =everyday events that are normal and not that exciting=

  - As the days of celebration wore on, the formerly spectacular events began to seem more quotidian, and the king found himself yawning at the chariot races.
  - There is a precise schedule for taking care of quotidian tasks, but all your time is your own once you have completed them.
  - Every year Mrs. Anderson is faced with the task of taking quotidian assignments from the curriculum and trying to make them stimulating for her students.
  - Even though the life of rock stars may seem exciting and glamorous, the days they spend traveling while on tour are as quotidian as yours and mine.
  - Compared to the process of shopping for their time share, the couple found it difficult to sit through the quotidian necessity of ironing out the details in the contract.
  - Because Arthur has a simple quotidian talent for painting, he prefers to create art for his own enjoyment rather than exhibiting it to the public.
  - Emily has an admirable enthusiasm for life, and she attacks even the most quotidian of chores with energy and passion.
