ruby/Q.html


<div id="outline-container-sec-18" class="outline-2">
<h2 id="sec-18"><span class="section-number-2">18</span> <a href="https://wordsinasentence.com/quondam-in-a-sentence/">Quondam</a></h2>
<div class="outline-text-2" id="text-18">
<p>
<code>former; previous</code>
</p>

<ul class="org-ul">
<li>The quondam beauty queen was much more exotic than the one currently being crowned.
</li>
<li>Before retiring, the quondam editor trained me to take over his position.
</li>
<li>Readers were surprised that the quondam CEO was speaking out against the company that he helped build from the ground up.
</li>
<li>The quondam lovers could barely look at each other after they ended their relationship.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-19" class="outline-2">
<h2 id="sec-19"><span class="section-number-2">19</span> <a href="https://wordsinasentence.com/quotidian-in-a-sentence/">Quotidian</a></h2>
<div class="outline-text-2" id="text-19">
<p>
<code>everyday events that are normal and not that exciting</code>
</p>

<ul class="org-ul">
<li>As the days of celebration wore on, the formerly spectacular events began to seem more quotidian, and the king found himself yawning at the chariot races.
</li>
<li>There is a precise schedule for taking care of quotidian tasks, but all your time is your own once you have completed them.
</li>
<li>Every year Mrs. Anderson is faced with the task of taking quotidian assignments from the curriculum and trying to make them stimulating for her students.
</li>
<li>Even though the life of rock stars may seem exciting and glamorous, the days they spend traveling while on tour are as quotidian as yours and mine.
</li>
<li>Compared to the process of shopping for their time share, the couple found it difficult to sit through the quotidian necessity of ironing out the details in the contract.
</li>
<li>Because Arthur has a simple quotidian talent for painting, he prefers to create art for his own enjoyment rather than exhibiting it to the public.
</li>
<li>Emily has an admirable enthusiasm for life, and she attacks even the most quotidian of chores with energy and passion.
</li>
</ul>
</div>
</div>
</div>
</body>
</html>